{
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 768,
  "depths": [
    3,
    4,
    18,
    3
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    64,
    128,
    320,
    512
  ],
  "id2label": {
    "0": "background",
    "1": "BUS LANE",
    "2": "Yellow Markings",
    "3": "Line 1",
    "4": "Line 2",
    "5": "Crossing",
    "6": "Romb",
    "7": "SLOW",
    "8": "Left Arrow",
    "9": "Forward Arrow",
    "10": "Forward Arrow -Left",
    "11": "Forward Arrow -Right",
    "12": "Right Arrow",
    "13": "Bicycle"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "BUS LANE": 1,
    "Bicycle": 13,
    "Crossing": 5,
    "Forward Arrow": 9,
    "Forward Arrow -Left": 10,
    "Forward Arrow -Right": 11,
    "Left Arrow": 8,
    "Line 1": 3,
    "Line 2": 4,
    "Right Arrow": 12,
    "Romb": 6,
    "SLOW": 7,
    "Yellow Markings": 2,
    "background": 0
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "transformers_version": "5.0.0"
}
